tap "bufbuild/buf"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "reviewdog/tap"
tap "yukiarrr/tap"
brew "anyenv"
brew "bat"
brew "glib"
brew "python@3.9"
brew "exa"
brew "fd"
brew "guile"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-secrets"
brew "go"
brew "gobject-introspection"
brew "grpcurl"
brew "guetzli"
brew "hub"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "jump"
brew "krb5"
brew "libfido2"
brew "node@16"
brew "mongosh"
brew "protobuf"
brew "mysql"
brew "tree-sitter"
brew "neovim"
brew "nginx", restart_service: true
brew "node"
brew "openjdk"
brew "peco"
brew "postgresql@14"
brew "python@3.10"
brew "ripgrep"
brew "rust"
brew "starship"
brew "telnet"
brew "tig"
brew "tmux"
brew "tree"
brew "reviewdog/tap/reviewdog"
brew "yukiarrr/tap/ecsk"
cask "alfred"
cask "bitwarden"
cask "coteditor"
cask "dbeaver-community"
cask "docker"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "ngrok"
cask "sketch"
cask "skitch"
cask "slack"
cask "virtualbox"
cask "visual-studio-code"
cask "xmind"
cask "zoomus"
vscode "adpyke.codesnap"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "CraigMaslowski.erb"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "frhtylcn.aws-sdk-snippets"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "GraphQL.vscode-graphql-syntax"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "JuanBlanco.solidity"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "MehediDracula.php-namespace-resolver"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "nmrmsys.vscode-sql-formatter-mod"
vscode "NomicFoundation.hardhat-solidity"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "Prisma.prisma"
vscode "rebornix.ruby"
vscode "sianglim.slim"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "taichi.vscode-textlint"
vscode "tamasfe.even-better-toml"
vscode "toba.vsfire"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "whatwedo.twig"
vscode "wingrunr21.vscode-ruby"
vscode "zxh404.vscode-proto3"
